Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: སུམ་ཅུ་རྩ་གསུམ་པའི་ཚོགས་ཀྱི་འཁོར་གྱིས་བསྐོར་བའི་བརྒྱ་བྱིན་ལྷ་མ་ཡིན་གྱི་དབང་པོའི་ཚོགས་རབ་ཏུ་འཇོམས་པ་ལྟར་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་ལས་བྱུང་བའི་ཡོན་ཏན་དྲི་མ་མྱེད་པའི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་ཟིལ་གྱིས་མྱི་གནོན་ལ་གཞན་ལ་ཟིལ་གྱིས་གནོན་པ་དེ།
en: Just as Śakra and his entourage of the host of Trāyastriṃśa devas defeat the hosts of the lord of the asuras, the entourage of the host of the stainless qualities that arise from the instructions of the kalyāṇamitras cannot be surpassed but overwhelm others.

source: མཐར་གྱིས་གྲོང་ཁྱེར་རྒྱ་མཚོ་བརྟན་པ་གང་ན་བ་དེར་ཕྱིན་ཏེ།
en: Eventually he arrived at the town called Samudra­pratiṣṭhāna.

source: དགེ་བསྙེན་མ་ཕུལ་དུ་བྱུང་བ་ཡོངས་སུ་ཚོལ་ཚོལ་བ་ལས་དེ་ལ་སྐྱེ་བོ་མང་པོས་བསྟན་ཏེ། རིགས་ཀྱི་བུ་དགེ་བསྙེན་མ་ཕུལ་དུ་བྱུང་བ་དེ་གྲོང་ཁྱེར་གྱི་དབུས་ཀྱི་རང་གི་ཁྱིམ་ན་འདུག་གོ་ཞེས་ནས།
en: When he was searching for the upāsikā Prabhūtā, a great crowd of people told him, “Noble one, the upāsikā Prabhūtā is in her house in the middle of the city.”

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགེ་བསྙེན་མ་ཕུལ་དུ་བྱུང་བའི་གནས་གང་ན་བ་དེར་སོང་སྟེ། ཐལ་མོ་སྦྱར་ནས་སྒོ་གང་ན་སྡོང་སྡོད་པ་དང་།
en: Sudhana, the head merchant’s son, went to the home of the upāsikā Prabhūtā, and with his palms together in homage, he stood at the door.

source: དེས་དགེ་བསྙེན་མ་ཕུལ་དུ་བྱུང་བའི་ཁྱིམ་དེ་ཤིན་ཏུ་རྒྱ་ཆེ་ལ་ཡངས་ཤིང་རིན་པོ་ཆེའི་ར་བས་ཡོངས་སུ་བསྐོར་བ་ཕྱོགས་བཞི་ནས་སྒོ་ཤིན་ཏུ་མཛེས་པ་རྣམ་པར་ཕྱེ་བ།
en: He saw that the upāsikā Prabhūtā’s house was encircled by a large and extensive precious wall.

source: རིན་པོ་ཆེ་ཚད་མྱེད་གྲངས་མྱེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། བསོད་ནམས་ཀྱི་རྣམ་པར་སྨིན་པས་མངོན་པར་གྲུབ་པ་མཐོང་ནས།
en: It had a gateway in each of the four directions and was adorned with countless measureless jewels that had been created from the ripening of merit.

source: དེ་ཁྱིམ་དེར་སོང་སྟེ།
en: Sudhana entered the house, looked around, and saw the upāsikā Prabhūtā seated on a precious throne.

source: ཀུན་ཏུ་བལྟས་ན་དགེ་བསྙེན་མ་ཕུལ་དུ་བྱུང་བ་ན་ཆུང་ཤིན་ཏུ་གཞོན་པ་ཐོག་མ་དར་ལ་བབ་པ།
en: She was a very young maiden who had newly become an adult, having just reached puberty.

source: གཟུགས་མངོན་ཞིང་མཛེས་ལ་བལྟ་ན་སྡུག་པ་ཁ་དོག་དམ་པ།
en: She was surpassingly beautiful, attractive, and lovely to look at.

source: པྲི་ཡབ་ཤིན་ཏུ་རྒྱས་པ་དང་ལྡན་པ།
en: Her skin was an excellent, perfect color.

source: སྐྲ་ཕྱེ་མར་བཞག་པ།
en: Her hair hung loose.

source: ལུས་ལ་རྒྱན་མྱེད་པ།
en: She wore no jewelry.

source: གོས་དང་སྨད་གཡོགས་དཀར་པོ་བགོས་པ། རིན་པོ་ཆེའི་ཁྲི་ལ་འདུག་པ་མཐོང་སྟེ། སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་མ་གཏོགས་པར་དེའི་ལུས་སམ། སེམས་ཀྱི་དབང་ངམ།
en: She wore a white robe and skirt.

source: གཟི་བརྗིད་དང་། ཁ་དོག་གིས་ཟིལ་གྱིས་མ་ནོན་པའི་སེམས་ཅན་ནི་ཁྱིམ་དེ་ན་གང་ཡང་མྱེད་དེ། ལྷའམ་མིའང་རུང་སྟེ། སེམས་ཅན་གང་གིས་དགེ་བསྙེན་མ་ཕུལ་དུ་བྱུང་བ་མཐོང་བར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་། དགེ་བསྙེན་མ་ཕུལ་དུ་བྱུང་བ་ལ་སྟོན་པའི་འདུ་ཤེས་སུ་བསམ་པ་ཞིག །
en: Every being who saw the upāsikā Prabhūtā, whether deva or human, conceived of the upāsikā Prabhūtā as being their teacher.

source: རིན་པོ་ཆེའི་ཁྲི་ལ་འདུག་པ་མཐོང་ངོ་། །
en: Apart from buddhas and bodhisattvas, everyone else who came into that house was overwhelmed by her body, the power of her mind, her majesty, and her color.

source: གཞན་ཡང་ཁྱིམ་དེ་ན་སྟན་ལྷ་རྫས་དང་།
en: Also, a hundred trillion seats had been arranged in that house.

source: མྱིའི་རྫས་ལས་ཤིན་ཏུ་འཕགས་པ།
en: They were superior to any human or deva seat.

source: བྱང་ཆུབ་སེམས་དཔའི་ལས་ཀྱི་རྣམ་པར་སྨིན་པས་ཡོངས་སུ་གྲུབ་པ་བྱེ་བ་སྟོང་ཕྲག་བཅུ་བཏིང་བ་དང་།
en: They had been created through the ripening of a bodhisattva’s karma.

source: མདུན་དུ་ཕྲུ་བ་གཅིག་ཅིག་བཞག་པ་ལས་ཁ་ཟས་དང་སྐོམ་གྱི་བག་གམ། གོས་དང་རྒྱན་གྱི་ལོངས་སྤྱོད་ཀྱི་བག་གཞན་ཅི་ཡང་མྱི་སྣང་ངོ་། །
en: Sudhana did not see any store of food or drink in the house, nor did he see any store of clothing, jewelry, or possessions apart from a single small pot placed before her.

source: བུད་མྱེད་སྟོང་ཕྲག་བཅུ་ཙམ་ཞིག་མདུན་དུ་འདུག་པར་མཐོང་ནའང་དེ་དག་ཐམས་ཅད་ཀྱང་ལྷའི་བུ་མོའི་ཁ་དོག་དང་ལྡན་པ། ལྷའི་བུ་མོའི་གཟུགས་དང་ལྡན་པ། ལྷའི་བུ་མོའི་ཚུལ་དང་ལྡན་པ། ལྷའི་བུ་མོའི་སྤྱོད་པ་དང་ལྡན་པ།
en: Sudhana saw ten thousand maidens in front of her.

source: ལྷའི་བུ་མོའི་ལོངས་སྤྱོད་དང་ལྡན་པ། ལྷའི་བུ་མོའི་ཚུལ་དུ་ཤིས་པ་དང་ལྡན་པ། ལྷ་རྫས་ཀྱི་གོས་ཡིད་བཞིན་དུ་གྱོན་པ། ལྷ་རྫས་ཀྱི་ལྷབ་ལྷུབ་ཀྱིས་ཤིན་ཏུ་ཀླུབས་པ། ལྷའི་བུ་མོའི་སྐད་ལྟ་བུའི་དབྱངས་སྙན་པ་དང་ལྡན་པ་ལྷའི་བུ་མོའི་ཆུ་ཞེང་མཛེས་པ་དང་ལྡན་པ་ཤ་སྟག་སྟེ།
en: They all had the skin color of apsarases, the bodies of apsarases, the manner of apsarases, the behavior of apsarases, the pleasures of apsarases, the courtesy of apsarases, the divine clothing of apsarases, the jewelry of apsarases, and the beautiful-sounding voices of apsarases, and their waists were like those of apsarases.

source: དེའི་འཁོར་གྱི་བུད་མྱེད་ཀྱང་དེས་ཅི་བསྒོ་བ་བཞིན་དུ་བྱེད་ཅིང་མདུན་ན་འཁོད་དོ། །རིམ་གྲོ་བྱེད་དོ། །བཀུར་སྟི་བྱེད་དོ། །གདོང་དུ་ལྟའོ། །ཅི་བསྒོ་བ་ཉན་ཅིང་གནས་སོ། །རྗེ་སར་འཁོད་དོ། ཡོངས་སུ་ལྟའོ། རྣམ་པར་ལྟའོ། །འདུད་དོ། །རབ་ཏུ་འདུད་དོ། །ཕྱག་འཚལ་ལོ། །དེ་དག་གི་ལུས་ལས་སྤོས་ཀྱི་ངད་ལྡང་བས་ནི། གྲོང་ཁྱེར་དེའི་འཁོར་ཐམས་ཅད་དུ་དྲི་ཞིམ་པོས་ཁྱབ་པར་འདུག་སྟེ། སེམས་ཅན་གང་གིས་དྲི་དེ་ཚོར་བར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་གནོད་སེམས་མྱེད་པའི་སེམས་དང་། ཤར་གཉེར་བ་མྱེད་པའི་སེམས་དང་། འཚེ་བ་མྱེད་པའི་སེམས་དང་།
en: Her entourage of maidens was stationed before her, fulfilling all her instructions, gazing upon her, honoring her, venerating her, showing her respect, facing her, listening to her, looking upon her, gazing upon her, bowing down to her, making obeisance to her, and paying homage to her.

source: ཕྲག་དོག་དང་། འཇུངས་པ་དང་བྲལ་བའི་སེམས་དང་། སྒྱུ་དང་གཡོ་མྱེད་པའི་སེམས་དང་། ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་མྱེད་པའི་སེམས་དང་། ཞུམ་པ་དང་། གཟེངས་མཐོང་བ་མྱེད་པའི་སེམས་དང་། བྱམས་པའི་སེམས་དང་། ཕན་པའི་སེམས་དང་།
en: The perfume that emanated from their bodies filled the entire surrounding town with its pleasant aroma, and when beings smelled that aroma, they all ceased to have malice in their minds, ceased to have animosity in their minds, ceased to have aggression in their minds, ceased to have jealousy and greed in their minds, ceased to have deception and deceit in their minds, ceased to have craving and anger in their minds, ceased to go back and forth between low and high spirits, and had loving minds, altruistic minds, self-controlled minds, and minds that did not wish to acquire the possessions of others.

source: སྡོམ་པ་ལ་གནས་པའི་སེམས་དང་། གཞན་གྱིས་ཡོངས་སུ་བཟུང་བ་ལ་རེ་བ་མྱེད་པའི་སེམས་སུ་གྱུར་ཏེ། གང་གིས་དེ་དག་གི་སྐད་ཐོས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་དགའ་བ་དང་། མོས་པ་དང་། དུལ་བའི་སེམས་དང་ལྡན་པར་འགྱུར་རོ། །
en: All those who heard the voices of those maidens became delighted, reverent, and subdued.

source: གང་གིས་དེ་དག་མཐོང་བར་གྱུར་པ་དེ་དག་ཀྱང་། འདོད་ཆགས་དང་བྲལ་བ་ཙམ་དུ་རང་རང་གིས་ཤེས་པར་འགྱུར་རོ། དེ་ལྟར་མཐོང་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་དགེ་བསྙེན་མ་ཕུལ་དུ་བྱུང་བའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། དགེ་བསྙེན་མ་ཕུལ་དུ་བྱུང་བ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་མདུན་དུ་འདུག་སྟེ།
en: Having seen this, Sudhana, the head merchant’s son, bowed his head to the feet of the upāsikā Prabhūtā, circumambulated her many hundreds of thousands of times, keeping her to his right, and sat before her.

source: ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་མ་བདག་གིས་བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: With his palms together in homage, Sudhana said, “Āryā, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: འཕགས་མ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པ་མཛད་དོ་ཞེས་བདག་གིས་ཐོས་ན།
en: Āryā, I have heard that you give instruction and teachings to bodhisattvas!

source: འཕགས་མ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་བདག་ལ་བཤད་དུ་གསོལ།
en: I pray that you explain to me how bodhisattvas should train in bodhisattva conduct and how they should practice it!”

source: སྨྲས་པ་རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ། བསོད་ནམས་ཀྱི་མཛོད་མྱི་ཟད་པའི་རྒྱན་ཅེས་བྱ་བ་ཐོབ་པ་སྟེ།
en: The upāsikā Prabhūtā said, “Noble one, I have attained the bodhisattva liberation called the unceasing display of the treasure of merit.

source: རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་ཕྲུ་བ་གཅིག་པོ་འདི་ལས་མོས་པ་སྣ་ཚོགས་ཅན་རྣམས་ཁ་ཟས་ཅི་ལ་དགའ་བ་བཞིན་དུ་ཚོད་མ་སྣ་ཚོགས་དང་། རོ་སྣ་ཚོགས་དང་། ཁ་དོག་སྣ་ཚོགས་དང་། དྲི་སྣ་ཚོགས་ཀྱིས་ཚིམ་པར་བྱེད་དེ།
en: “Noble one, from this small pot, beings with different wishes are satisfied by whatever foods they enjoy, with various kinds of broths, various flavors, various colors, and various aromas.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོ་ནི་ཕྲུ་བ་གཅིག་པོ་འདི་ལས་ཅི་ལ་དགའ་བའི་ཁ་ཟས་ཀྱིས་སེམས་ཅན་བརྒྱ་འང་ཡོངས་སུ་ཚིམ་པར་བྱེད་དོ། །སེམས་ཅན་སྟོང་དང་སེམས་ཅན་བརྒྱ་ཕྲག་སྟོང་དང་། སེམས་ཅན་བྱེ་བ་དང་།
en: “Noble one, in that way, with this one small pot I can satisfy a hundred beings with the foods they enjoy.

source: སེམས་ཅན་བྱེ་བ་ཕྲག་བརྒྱ་དང་། སེམས་ཅན་བྱེ་བ་ཕྲག་སྟོང་དང་། སེམས་ཅན་བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་དང་། སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་ནས། སེམས་ཅན་བརྗོད་དུ་མྱེད་པའི་ཡང་བརྗོད་དུ་མྱེད་པ་མོས་པ་སྣ་ཚོགས་ཅན་རྣམས་ཀྱང་ཅི་ལ་དགའ་བའི་ཁ་ཟས་ཀྱིས་ཡོངས་སུ་ཚིམ་པར་བྱེད་དོ། །ཡོངས་སུ་སྟོབས་པར་བྱེད་དོ། །
en: I can satisfy with the foods they enjoy a hundred thousand beings, ten million beings, a billion beings, a trillion beings, a quintillion beings, and an innumerably-beyond-an-innumerable number of beings with different wishes.

source: ཡོངས་སུ་དགའ་བར་བྱེད་དོ། ཡོངས་སུ་མགུ་བར་བྱེད་དོ། །ཡོངས་སུ་སྤྲོ་བར་བྱེད་དོ། །ཤིན་ཏུ་ཚིམ་པར་བྱེད་དོ། །ཡིད་བདེ་བར་བྱེད་དོ། །
en: I strengthen them, make them joyful, please them, delight them, make them content, and make them happy.

source: འོན་ཀྱང་ཕྲུ་བ་འདི་ལས་འགོང་བར་འགྱུར་བ་མེད་དོ། །འགྲིབ་མྱེད་དེ་དམའ་བར་མྱི་འགྱུར་རོ། །ཟད་པར་མྱི་འགྱུར་རོ། འབྲི་བར་མྱི་འགྱུར་རོ། །ས་མཚམས་ཡོད་པར་མྱི་འགྱུར་རོ། །མཐར་ཐུག་པར་མྱི་འགྱུར་རོ། །མུར་ཐུག་པར་མྱི་འགྱུར་རོ། །རིགས་ཀྱི་བུ་གཞུང་དེ་དང་འདྲ་བར་སེམས་ཅན་འཛམ་བུའི་གླིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་། དེ་བཞིན་དུ་གླིང་བ་ཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་། སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་།
en: Nevertheless, this small pot is never diminished, depleted, emptied, used up, exhausted, spent, or finished, nor does it ever come to an end.

source: སྟོང་གཉིས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ནས་སེམས་ཅན་མོས་པ་སྣ་ཚོགས་ཅན་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མྱེད་པའི་ཡང་བརྗོད་དུ་མྱེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་འོངས་ཀྱང་། ཅི་ལ་དགའ་བའི་ཁ་ཟས་ཚོད་མ་སྣ་ཚོགས་དང་། རོ་སྣ་ཚོགས་དང་། ཁ་དོག་སྣ་ཚོགས་དང་། དྲི་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་ཚིམ་པར་བྱེད་དོ། །ཡོངས་སུ་དགའ་བར་བྱེད་དོ། །ཉམས་བདེ་བར་བྱེད་དོ། །ཤིན་ཏུ་ཚིམ་པར་བྱེད་དོ། ཡིད་ཤིན་ཏུ་བདེ་བར་བྱེད་དོ། །
en: “Noble one, in the same way, I can satisfy, make joyful, please, delight, make content, and make happy, with whatever foods they enjoy and with various kinds of broths, various flavors, various colors, and various aromas, beings with different wishes who are as numerous as the atoms in a world realm of four continents, as numerous as the atoms in a world realm of a thousand four-continent worlds, as numerous as the atoms in a world realm of a million four-continent worlds, as numerous as the atoms in a world realm of a billion four-continent worlds, and as numerous as the atoms in innumerably more numerous than innumerable buddha realms.

source: འོན་ཀྱང་ཕྲུ་བ་འདི་ལས་འགོང་བར་འགྱུར་བ་མྱེད་དོ། །འགྲིབ་པ་མྱེད་དོ། །དམའ་བར་མྱི་འགྱུར་རོ། །ཟད་པར་མྱི་འགྱུར་རོ། །ས་མཚམས་ཡོད་པར་མྱི་འགྱུར་རོ། །མཐར་ཐུག་པར་མྱི་འགྱུར་རོ། །
en: “Nevertheless, this small pot is never diminished, depleted, emptied, used up, exhausted, spent, or finished, nor does it ever come to an end.

source: མུར་ཐུག་པར་མྱི་འགྱུར་རོ། །རིགས་ཀྱི་བུ་གལ་ཏེ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་གཏོགས་པའི་སེམས་ཅན་མོས་པ་སྣ་ཚོགས་ཅན་དང་། བསམ་པ་སྣ་ཚོགས་ཅན་ཐམས་ཅད་འོངས་པར་གྱུར་ན་ཡང་། དེ་དག་ཐམས་ཅད་ཅི་ལ་དགའ་བའི་ཁ་ཟས་ཀྱིས་ཡོངས་སུ་ཚིམ་པར་བྱེད་པ་ནས། ཡིད་བདེ་བར་བྱ་བའི་བར་དུ་བྱེད་དོ། །ཁ་ཟས་སྣ་ཚོགས་ཀྱིས་ཇི་ལྟ་བ་དེ་བཞིན་དུ་བཏུང་བ་རྣམ་པ་སྣ་ཚོགས་དང་། རོ་རྣམ་པ་སྣ་ཚོགས་དང་། སྟན་སྣ་ཚོགས་དང་། མལ་ཆ་སྣ་ཚོགས་དང་། བཞོན་པ་སྣ་ཚོགས་དང་།
en: “Noble one, if the beings in all world realms in the ten directions, all with different wishes and aspirations, were all to come here, they would all be satisfied and so on up to made happy by the food they enjoy.

source: གོས་སྣ་ཚོགས་དང་། མེ་ཏོག་སྣ་ཚོགས་དང་། ཕྲེང་བ་སྣ་ཚོགས་དང་། སྤོས་སྣ་ཚོགས་དང་། བདུག་སྤོས་སྣ་ཚོགས་དང་། བྱུག་པ་སྣ་ཚོགས་དང་། ཕྱེ་མ་སྣ་ཚོགས་དང་། རིན་པོ་ཆེ་སྣ་ཚོགས་དང་། རྒྱན་སྣ་ཚོགས་དང་། རིན་པོ་ཆེའི་ཤིང་རྟ་སྣ་ཚོགས་དང་། གདུགས་སྣ་ཚོགས་དང་། རྒྱལ་མཚན་སྣ་ཚོགས་དང་། ལྷའི་བ་དན་སྣ་ཚོགས་དང་། ཡོ་བྱད་ཀྱི་ཡུལ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་ཚིམ་པར་བྱེད་པ་ནས། ཡིད་དགའ་བར་འགྱུར་བའི་བར་དུ་བྱེད་དོ། །
en: Just as it would be with various kinds of food, they would all be satisfied and so on up to made happy by various kinds of drinks, by various kinds of flavors, by various kinds of seats, by various kinds of beds, by various kinds of steeds, by various kinds of clothing, by various kinds of flowers, by various kinds of garlands, by various kinds of perfume, by various kinds of incense, by various kinds of ointments, by various kinds of powders, by various kinds of jewels, by various kinds of jewelry, by various kinds of precious carriages, by various kinds of parasols, by various kinds of banners, by various kinds of flags, and by various kinds from among the entire range of utensils.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ན་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་སྐུའི་ཐ་མ་འཛིན་པ་གང་ཇི་སྙེད་ཅིག་བཞུགས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཁོ་མོའི་ཁ་ཟས་ལས་གསོལ་ཅིང་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཀྱི་འབྲས་བུ་བརྙེས་པར་མཛད་དོ། །ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ན་ཇི་ལྟ་བ་དེ་བཞིན་དུ་འཇིག་རྟེན་གྱི་ཁམས་བརྒྱ་དང་། འཇིག་རྟེན་གྱི་ཁམས་སྟོང་དང་། འཇིག་རྟེན་གྱི་ཁམས་བརྒྱ་ཕྲག་སྟོང་དང་། འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཕྲག་བརྒྱ་དང་། འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཕྲག་སྟོང་དང་།
en: “Moreover, noble one, all the śrāvakas and pratyeka­buddhas in a single world realm in the east, who are in their final life, attain the result of the śrāvaka and pratyeka­buddha enlightenments by eating my food.

source: འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་དང་། འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་དང་། འཇིག་རྟེན་གྱི་ཁམས་འཛམ་བུའི་གླིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་། གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་། སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་། སྟོང་གཉིས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ནས།
en: Just as it is in one realm in the east, so it is in a hundred world realms, a thousand world realms, a hundred thousand world realms, ten million world realms, a billion world realms, ten billion world realms, a hundred billion world realms, a quintillion world realms, and world realms as numerous as the atoms in the world realm of Jambudvīpa, as the atoms in a world realm of four continents, as the atoms in a world realm of a thousand four-continent worlds, as the atoms in a world realm of a million four-continent worlds, and as the atoms in a world realm of a billion four-continent worlds.

source: དེ་བཞིན་དུ་ཤར་ཕྱོགས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མྱེད་པའི་ཡང་བརྗོད་དུ་མྱེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ན་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་སྐུའི་ཐ་མ་འཛིན་པ་ཇི་སྙེད་ཅིག་བཞུགས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཁོ་མོའི་ཁ་ཟས་ལས་གསོལ་ཅིང་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་འབྲས་བུ་བརྙེས་པར་མཛད་དོ། །ཤར་ཕྱོགས་ན་བཞུགས་པ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ལྷོ་ཕྱོགས་དང་། ནུབ་ཕྱོགས་དང་། བྱང་ཕྱོགས་དང་།
en: “In the same way, all the śrāvakas and pratyeka­buddhas in world realms as numerous as the atoms in innumerably more numerous than innumerable buddha realms in the east, who are in their final life, will attain the result of the śrāvaka and pratyeka­buddha enlightenments by eating my food.

source: བྱང་ཤར་གྱི་ཕྱོགས་མཚམས་དང་། ཤར་ལྷོའི་ཕྱོགས་མཚམས་དང་། ལྷོ་ནུབ་ཀྱི་ཕྱོགས་མཚམས་དང་། ནུབ་བྱང་གི་ཕྱོགས་མཚམས་དང་། འོག་དང་སྟེང་གི་ཕྱོགས་ན་ཇི་སྙེད་ཅིག་བཞུགས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་དེ་བཞིན་ནོ། །
en: “Just as it is for those who are in the east, so it is for all of those who are in the south, in the west, in the north, in the northeast, in the southeast, in the southwest, in the northwest, below, and above.

source: རིགས་ཀྱི་བུ་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ན་སྐུ་ཚེ་གཅིག་གིས་ཐོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཇི་སྙེད་ཅིག་བཞུགས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཁོ་མོའི་ཁ་ཟས་ལས་གསོལ་ཅིང་། སྙིང་པོ་བྱང་ཆུབ་ཏུ་བཞུགས་ནས་བདུད་སྡེ་དང་བཅས་པ་ཕམ་པར་མཛད་དེ། བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱའོ། །ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ན་བཞུགས་པ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་འཇིག་རྟེན་གྱི་ཁམས་བརྒྱ་དང་། འཇིག་རྟེན་གྱི་ཁམས་སྟོང་དང་། འཇིག་རྟེན་གྱི་ཁམས་བརྒྱ་ཕྲག་སྟོང་དང་། འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་བརྒྱ་དང་།
en: “Noble one, all those who are bodhisattvas in their last life in a single world realm in the east will, by eating my food, be seated at the bodhimaṇḍa, defeat Māra and his armies, and attain the highest, complete enlightenment of buddhahood.

source: འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་སྟོང་དང་། འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་དང་། འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་དང་། འཇིག་རྟེན་གྱི་ཁམས་འཛམ་བུའི་གླིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་། གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་། སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་། །སྟོང་གཉིས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ནས།
en: “Just as it is for those in one realm in the east, so it is in a hundred world realms, a thousand world realms, a hundred thousand world realms, ten million world realms, a billion world realms, ten billion world realms, a hundred billion world realms, a quintillion world realms, and world realms as numerous as the atoms in the world realm of Jambudvīpa, as the atoms in a world realm of four continents, as the atoms in a world realm of a thousand four-continent worlds, as the atoms in a world realm of a million four-continent worlds, and as the atoms in a world realm of a billion four-continent worlds.

source: ཤར་ཕྱོགས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མྱེད་པའི་ཡང་བརྗོད་དུ་མྱེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ན། བྱང་ཆུབ་སེམས་དཔའ་སྐུ་ཚེ་གཅིག་གིས་ཐོགས་པ་ཇི་སྙེད་ཅིག་བཞུགས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཁོ་མོའི་ཁ་ཟས་ལས་གསོལ་ཞིང་སྙིང་པོ་བྱང་ཆུབ་ལ་བཞུགས་ནས། བདུད་སྡེ་དང་བཅས་པ་ཕམ་པར་མཛད་དོ། །བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱའོ།། ཤར་ཕྱོགས་ན་བཞུགས་པ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ལྷོ་ཕྱོགས་དང་། ནུབ་ཕྱོགས་དང་། བྱང་ཕྱོགས་དང་། བྱང་ཤར་གྱི་ཕྱོགས་མཚམས་དང་།
en: Those and others up to all those who are bodhisattvas in their last life in world realms as numerous as the atoms in innumerably more numerous than innumerable buddha realms in the east will, by eating my food, be seated at the bodhimaṇḍa, defeat Māra and his armies, and attain the highest, complete enlightenment of buddhahood.

source: ཤར་ལྷོའི་ཕྱོགས་མཚམས་དང་། ལྷོ་ནུབ་ཀྱི་ཕྱོགས་མཚམས་དང་། ནུབ་བྱང་གི་ཕྱོགས་མཚམས་དང་། འོག་གི་ཕྱོགས་དང་། སྟེང་གི་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ན། བྱང་ཆུབ་སེམས་དཔའ་སྐུ་ཚེ་གཅིག་གིས་ཐོགས་པ་ཇི་སྙེད་ཅིག་བཞུགས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཁོ་མོའི་ཁ་ཟས་ལས་གསོལ་ཅིང་སྙིང་པོ་བྱང་ཆུབ་ཏུ་བཞུགས་ཏེ། བདུད་སྡེ་དང་བཅས་པ་རབ་ཏུ་ཕམ་པར་མཛད་ནས། བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱའོ། །ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ན་བཞུགས་པ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་འཇིག་རྟེན་གྱི་ཁམས་བརྒྱ་དང་། འཇིག་རྟེན་གྱི་ཁམས་སྟོང་དང་། འཇིག་རྟེན་གྱི་ཁམས་བརྒྱ་ཕྲག་སྟོང་དང་། འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་བརྒྱ་དང་། འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་སྟོང་དང་།
en: “Just as it is for those who are in the east, in the same way all those who are bodhisattvas in their last life in one world realm in the south, in the west, in the north, in the northeast, in the southeast, in the southwest, in the northwest, below, and above will, by eating my food, be seated at the bodhimaṇḍa, defeat Māra and his armies, and attain the highest, complete enlightenment of buddhahood.

source: འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་དང་། འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་དང་། འཇིག་རྟེན་གྱི་ཁམས་འཛམ་བུའི་གླིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་། གླིང་བཞི་བའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་། སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་། སྟོང་གཉིས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ནས། རིགས་ཀྱི་བུ་སྟེང་གི་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མྱེད་པའི་ཡང་བརྗོད་དུ་མྱེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ན།
en: “Just as it for all those who are bodhisattvas in their last life and so on up to those in one realm in the upward direction, so it is in a hundred world realms, a thousand world realms, a hundred thousand world realms, ten million world realms, a billion world realms, ten billion world realms, a hundred billion world realms, a quintillion world realms, and world realms as numerous as the atoms in the world realm of Jambudvīpa, as the atoms in a world realm of four continents, as the atoms in a world realm of a thousand four-continent worlds, as the atoms in a world realm of a million four-continent worlds, as the atoms in a world realm of a billion four-continent worlds, and so on, up to all those who are bodhisattvas in their last life in world realms in the upward direction that are as numerous as the atoms in innumerably more numerous than innumerable buddha realms in the east.

source: བྱང་ཆུབ་སེམས་དཔའ་སྐུ་ཚེ་གཅིག་གིས་ཐོགས་པ་ཇི་སྙེད་ཅིག་བཞུགས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཁོ་མོའི་ཁ་ཟས་ལས་གསོལ་ཅིང་། སྙིང་པོ་བྱང་ཆུབ་ཏུ་བཞུགས་ནས་བདུད་སྡེ་དང་བཅས་པ་ཕམ་པར་མཛད་དེ། བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱའོ།
en: All those who are bodhisattvas in their last life will, by eating my food, be seated at the bodhimaṇḍa, defeat Māra and his armies, and attain the highest, complete enlightenment of buddhahood.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཁོ་མོའི་འཁོར་བུད་མྱེད་སྟོང་ཕྲག་བཅུ་པོ་འདི་དག་མཐོང་ངམ། སྨྲས་པ་འཕགས་མ་བདག་གིས་མཐོང་ངོ་། །སྨྲས་པ་རིགས་ཀྱི་བུ་བུད་མྱེད་འདི་དག་ལ་སྩོགས་བ་བརྒྱ་སྟོང་གྲངས་མྱེད་པ་ཕྲག་བཅུ་ཁོ་མོ་དང་སྐལ་བ་མཉམ་པར་སྤྱོད་པ། སྨོན་ལམ་གཅིག་པ། དགེ་བའི་རྩ་བ་གཅིག་པ། འབྱུང་བའི་རྒྱན་གཅིག་པ། མོས་པའི་ལམ་རྣམ་པར་དག་པ་གཅིག་པ། ཁོ་མོ་དང་སྐལ་བ་མཉམ་པར་དྲན་པ་རྣམ་པར་དག་པ། སྐལ་བ་མཉམ་པར་བློ་རྣམ་པར་དག་པ། སྐལ་བ་མཉམ་པར་བློ་ཚད་མྱེད་པར་གྱུར་པ། སྐལ་བ་མཉམ་པར་དབང་པོ་རབ་ཏུ་ཐོབ་པ། སྐལ་བ་མཉམ་པར་སེམས་ཀྱིས་རྒྱས་པར་འགེངས་པ། སྐལ་བ་མཉམ་པར་སྤྱོད་ཡུལ་གྱི་ཡུལ་དང་ལྡན་པ། སྐལ་བ་མཉམ་པར་ཆོས་ཀྱི་ཚུལ་ལ་ཞུགས་པ། སྐལ་བ་མཉམ་པར་དོན་ངེས་པར་རྟོགས་པ། སྐལ་བ་མཉམ་པར་ཆོས་ཀྱི་དོན་སྟོན་པ། སྐལ་བ་མཉམ་པར་གཟུགས་རྣམ་པར་དག་པ། སྐལ་བ་མཉམ་པར་སྟོབས་ཚད་མེད་པ།
en: “Noble one, do you see these ten thousand maidens?”

source: སྐལ་བ་མཉམ་པར་བརྟན་པ་གཞན་གྱིས་མྱི་ཐུབ་པ། སྐལ་བ་མཉམ་པར་ཆོས་ཀྱི་སྒྲ་སྒྲོག་པ། སྐལ་བ་མཉམ་པར་དབྱངས་རྣམ་པར་དག་པ། ཚད་མྱེད་པའི་ཡོན་ཏན་བརྗོད་དུ་ཡོད་པས་རྣམ་པར་སྤྱོད་པ་ཐམས་ཅད་ལ་སྐལ་པ་མཉམ་པར་ཡོན་ཏན་རྣམ་པར་དག་པ། ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་ཁ་ན་མ་ཐོ་བ་མྱེད་ཅིང་རྣམ་པར་དག་པས། སྐལ་བ་མཉམ་པར་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་རྣམ་པར་དག་པ། འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་སྐྱོབ་པས། སྐལ་བ་མཉམ་པར་བྱམས་པ་ཆེན་པོས་རྒྱས་པར་འགེངས་པ། འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱེད་པས། མྱི་སྐྱོ་བའི་ཕྱིར་སྐལ་བ་མཉམ་པར་སྙིང་རྗེ་ཆེན་པོས་རྒྱས་པར་འགེངས་པ།
en: Sudhana replied, “Āryā, I see them.”
